Revit 2027 API
ParameterTypeId.PathReinHookOrient2Slab Property
 "Alternating Bar - Hook Orientation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PathReinHookOrient2Slab { get; }
Public Shared ReadOnly Property PathReinHookOrient2Slab As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PathReinHookOrient2Slab {
	ForgeTypeId^ get ();
}
static member PathReinHookOrient2Slab : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace